Delans-TLE/src/InformationRegisters/СостоянияСинхронизацииТорговыеПредложения/СостоянияСинхронизацииТорговыеПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияСинхронизацииТорговыеПредложения</name>
  <resources>
    <name>ДатаСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСинхронизацииТорговыеПредложения</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеСинхронизации</name>
    <type>
      <types>EnumRef.ДействияСинхронизацииТорговыеПредложения</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьОЗаказах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьКартинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьСрокиПоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТорговоеПредложение</name>
    <type>
      <types>DefinedType.ТорговоеПредложение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/InformationRegisters/СостоянияСинхронизацииТорговыеПредложения/Forms/НастройкиПубликации/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.ТорговоеПредложение.Пустая() Тогда
		
		ТекущаяЗапись = РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения.СоздатьМенеджерЗаписи();
		ТекущаяЗапись.ТорговоеПредложение = Параметры.ТорговоеПредложение;
		СвойстваПредложения = Новый Структура("Организация, Валюта");
		ТорговыеПредложенияПереопределяемый.ПолучитьСвойстваТорговогоПредложения(Параметры.ТорговоеПредложение,
			СвойстваПредложения);
		ТекущаяЗапись.Организация = СвойстваПредложения.Организация;
		
		ТекущаяЗапись.Прочитать();
		
		Если ТекущаяЗапись.Выбран() Тогда
			ЗначениеВРеквизитФормы(ТекущаяЗапись, "Запись");
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность(Запись, Элементы);
	
	// Установка видимости публикации остатков в прикладном решении.
	ТорговыеПредложенияПереопределяемый.ВыгружатьОтносительныеОстаткиТоваров(Элементы.ПубликоватьОстатки.Видимость);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.УведомлятьОЗаказах Тогда
		Если ПустаяСтрока(Запись.АдресЭлектроннойПочты) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Введите адрес электронной почты'"), , "АдресЭлектроннойПочты", , Отказ);
		ИначеЕсли Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Запись.АдресЭлектроннойПочты, Истина) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Адрес электронной почты введен неверно'"), , "АдресЭлектроннойПочты", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Запись.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация");
	
	ЗначенияЗаписи = Новый Структура;
	ЗначенияЗаписи.Вставить("ТорговоеПредложение",      Запись.ТорговоеПредложение);
	ЗначенияЗаписи.Вставить("Организация",              Запись.Организация);
	ЗначенияЗаписи.Вставить("АдресЭлектроннойПочты",    Запись.АдресЭлектроннойПочты);
	ЗначенияЗаписи.Вставить("УведомлятьОЗаказах",       Запись.УведомлятьОЗаказах);
	ЗначенияЗаписи.Вставить("ПубликоватьОстатки",       Запись.ПубликоватьОстатки);
	ЗначенияЗаписи.Вставить("ПубликоватьСрокиПоставки", Запись.ПубликоватьСрокиПоставки);
	ЗначенияЗаписи.Вставить("ПубликоватьЦены",          Запись.ПубликоватьЦены);
	ЗначенияЗаписи.Вставить("ДополнительноеОписание",   Запись.ДополнительноеОписание);
	Оповестить("ТорговыеПредложения_ЗаписьДополнительныеНастройки", ЗначенияЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Запись.ТорговоеПредложение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УведомлятьОЗаказахПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность(Запись, Элементы)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Запись, Элементы)
	
	Элементы.АдресЭлектроннойПочты.Доступность = Запись.УведомлятьОЗаказах;
	Элементы.АдресЭлектроннойПочты.АвтоОтметкаНезаполненного = Элементы.АдресЭлектроннойПочты.Доступность;
	
КонецПроцедуры

#КонецОбласти
